# Código Auxiliar para a Segunda Avaliação.

In [2]:
import pandas as pd
import sqlite3

As funções definidas abaixo, devem ser usada para acessar o banco de dados `bilheteria.db` e retornar os dados necessários para a resolução dos exercícios.

In [11]:
def carrega_tabela(database, tabela):
    '''
    Carrega uma tabela de um banco de dados 
    SQLite em um DataFrame do Pandas.
    Parâmetros:
    database: str - Caminho para o arquivo do banco de dados SQLite.
    tabela: str - Nome da tabela a ser carregada.
    '''
    with sqlite3.connect(database) as conn:
        query = f"SELECT * FROM {tabela}"
        df = pd.read_sql_query(query, conn)
    return df

In [12]:
def lista_tabelas(db_filename):
    '''
    Lista todas as tabelas em um banco de dados SQLite.
    Parâmetros:
    db_filename: str - Caminho para o arquivo do banco de dados SQLite.
    Retorna:
    DataFrame com os nomes das tabelas e suas contagens de linhas.
    '''
    # Connect to the SQLite database
    # conn = sqlite3.connect(db_filename)
    with sqlite3.connect(db_filename) as conn:
        cursor = conn.cursor()
        cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
        tables = cursor.fetchall()

        table_row_counts = []
        for table in tables:
            table_name = table[0]
            query = f"SELECT COUNT(*) FROM {table_name};"
            cursor.execute(query)
            row_count = cursor.fetchone()[0]
            table_row_counts.append({"Table": table_name, "Row_Count": row_count})

        return pd.DataFrame(table_row_counts)

## Exemplos de uso das funções

In [13]:
lista_tabelas('bilheteria.db')

            Table  Row_Count
0   distribuidora         72
1           filme        515
2  grupo_exibidor         64
3        exibidor        180
4        complexo        683
5            sala       3231
6          sessao    1748363

In [16]:
sessao = carrega_tabela('bilheteria.db', 'sessao')
sessao.data_exibicao = pd.to_datetime(sessao.data_exibicao, format='%d/%m/%Y')
sessao

              id  filme_id  sala_id  publico data_exibicao
0              1       253  5004897        8    2023-01-01
1              2       253  5001565       15    2023-01-01
2              3       253  5001566       14    2023-01-01
3              4       253  5003464       23    2023-01-01
4              5       253  5001137       37    2023-01-01
...          ...       ...      ...      ...           ...
1748358  1748359       405  5000331        5    2023-12-31
1748359  1748360       405  5000333       11    2023-12-31
1748360  1748361       405  5003637       32    2023-12-31
1748361  1748362       157  5001209      124    2023-12-31
1748362  1748363       157  5001073       22    2023-12-31

[1748363 rows x 5 columns]